documentation/tools/test_plan/test_fragment/report/statistics.json
{
  "/api/auth/login" : {
    "transaction" : "/api/auth/login",
    "sampleCount" : 1187,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 12992.175231676494,
    "medianResTime" : 11901.0,
    "minResTime" : 196.0,
    "maxResTime" : 39698.0,
    "pct1ResTime" : 24095.6,
    "pct2ResTime" : 27401.2,
    "pct3ResTime" : 33034.079999999965,
    "throughput" : 1.904838321431437,
    "receivedKBytesPerSec" : 1.1160723240792747,
    "sentKBytesPerSec" : 1.142409657586456
  },
  "/api/users/me" : {
    "transaction" : "/api/users/me",
    "sampleCount" : 1140,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 459.8289473684211,
    "medianResTime" : 305.0,
    "minResTime" : 3.0,
    "maxResTime" : 3704.0,
    "pct1ResTime" : 981.600000000004,
    "pct2ResTime" : 1400.9,
    "pct3ResTime" : 2455.2799999999925,
    "throughput" : 1.8711407721574254,
    "receivedKBytesPerSec" : 0.8424845948898161,
    "sentKBytesPerSec" : 1.5366416603337851
  },
  "/api/reservations/create" : {
    "transaction" : "/api/reservations/create",
    "sampleCount" : 1139,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 654.4978050921867,
    "medianResTime" : 498.0,
    "minResTime" : 8.0,
    "maxResTime" : 5692.0,
    "pct1ResTime" : 1192.0,
    "pct2ResTime" : 1596.0,
    "pct3ResTime" : 2856.5999999999904,
    "throughput" : 1.8552724595472418,
    "receivedKBytesPerSec" : 0.9021614193933796,
    "sentKBytesPerSec" : 1.8984881728416778
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 8067,
    "errorCount" : 299,
    "errorPct" : 3.7064583,
    "meanResTime" : 2310.4147762489147,
    "medianResTime" : 403.0,
    "minResTime" : 0.0,
    "maxResTime" : 39698.0,
    "pct1ResTime" : 7993.599999999999,
    "pct2ResTime" : 15699.599999999999,
    "pct3ResTime" : 25828.399999999972,
    "throughput" : 12.944023157077252,
    "receivedKBytesPerSec" : 7.9301048748479674,
    "sentKBytesPerSec" : 9.830702319458396
  },
  "/api/reservations/ccancelationId" : {
    "transaction" : "/api/reservations/ccancelationId",
    "sampleCount" : 1137,
    "errorCount" : 299,
    "errorPct" : 26.297274,
    "meanResTime" : 566.6517150395784,
    "medianResTime" : 409.0,
    "minResTime" : 5.0,
    "maxResTime" : 4480.0,
    "pct1ResTime" : 1095.2,
    "pct2ResTime" : 1410.9999999999927,
    "pct3ResTime" : 2254.839999999991,
    "throughput" : 1.8697736373428495,
    "receivedKBytesPerSec" : 0.6885793826416925,
    "sentKBytesPerSec" : 1.6277203294715463
  },
  "/mainPage" : {
    "transaction" : "/mainPage",
    "sampleCount" : 1187,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.2906486941870243,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 72.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 8.11999999999989,
    "throughput" : 1.9506182983443574,
    "receivedKBytesPerSec" : 1.1772286214617314,
    "sentKBytesPerSec" : 0.8438710021157718
  },
  "/api/reservations/user" : {
    "transaction" : "/api/reservations/user",
    "sampleCount" : 2277,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 570.8054457619672,
    "medianResTime" : 404.0,
    "minResTime" : 8.0,
    "maxResTime" : 4797.0,
    "pct1ResTime" : 1126.4000000000196,
    "pct2ResTime" : 1499.0,
    "pct3ResTime" : 2509.879999999999,
    "throughput" : 3.7439820052090185,
    "receivedKBytesPerSec" : 3.361680112438669,
    "sentKBytesPerSec" : 2.975710747176804
  }
}